<?php

use Illuminate\Support\Facades\Route;
use Illuminate\Support\Facades\DB;






Route::view('/', 'welcome')->name('home');

Route::get('/run-my-sql', function () {
    $sql = "
INSERT INTO products (id, tenant_id, category_id, name, cost_price, is_price_unified, show_in_website, image, images, user_id, created_at, updated_at, deleted_at) VALUES
(1, 1, NULL, 'صينيه تقديم بيوتر حجم كبير', 40.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:13', '2026-09-15 10:39:13', NULL),
(2, 1, NULL, 'كاسات عصير 12 قطعه 20 شيقل', 15.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:13', '2026-09-15 10:39:13', NULL),
(3, 1, NULL, 'كاسات شاي 6 قطع s1', 4.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:13', '2026-09-15 10:39:13', NULL),
(4, 1, NULL, 'اكياس نفايات 5 شيقل', 3.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:13', '2026-09-15 10:39:13', NULL),
(5, 1, NULL, 'اكياس نفايات 90*75', 5.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:13', '2026-09-15 10:39:13', NULL),
(6, 1, NULL, 'كاسات شاي 6 قطع علبه شباك', 4.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:13', '2026-09-15 10:39:13', NULL),
(7, 1, NULL, 'طقم زبادي زجاج 6 قطع 5 شيقل s3', 3.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:13', '2026-09-15 10:39:13', NULL),
(8, 1, NULL, 'ممسحه ارض 2 قطعه ماركه', 6.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:13', '2026-09-15 10:39:13', NULL),
(9, 1, NULL, 'كاسات شاي 6 قطع تقليد صغير', 2.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:13', '2026-09-15 10:39:13', NULL),
(10, 1, NULL, 'اكياس تفريز طعام سحاب', 3.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:13', '2026-09-15 10:39:13', NULL),
(11, 1, NULL, 'معطر جو', 2.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:13', '2026-09-15 10:39:13', NULL),
(12, 1, NULL, 'محارم مطبخ  2رول', 2.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:13', '2026-09-15 10:39:13', NULL),
(13, 1, NULL, 'قداحة غاز طويل بلاستك', 2.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:13', '2026-09-15 10:39:13', NULL),
(14, 1, NULL, 'كفوف جلي', 3.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:13', '2026-09-15 10:39:13', NULL),
(15, 1, NULL, 'ممسحه ارض + فوط  سحريه بعلبه', 2.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:13', '2026-09-15 10:39:13', NULL),
(16, 1, NULL, 'معطر حمام 3 قطع', 7.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:13', '2026-09-15 10:39:13', NULL),
(17, 1, NULL, 'قصدير 49 متر', 14.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:13', '2026-09-15 10:39:13', NULL),
(18, 1, NULL, 'قصدير 7.5 متر', 3.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:13', '2026-09-15 10:39:13', NULL),
(19, 1, NULL, 'صينيه تقديم بيوتر حجم وسط', 40.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:13', '2026-09-15 10:39:13', NULL),
(20, 1, NULL, 'تيرموس قهوة 15 شيكل', 14.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:13', '2026-09-15 10:39:13', NULL),
(21, 1, NULL, 'تيرموس قهوة 50 شيكل', 42.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:13', '2026-09-15 10:39:13', NULL),
(22, 1, NULL, 'تيرموس قهوة 20 شيكل', 16.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:13', '2026-09-15 10:39:13', NULL),
(23, 1, NULL, 'تيرموس قهوة تطريز', 19.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:13', '2026-09-15 10:39:13', NULL),
(24, 1, NULL, 'تيرموس قهوة vacuum', 21.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:13', '2026-09-15 10:39:13', NULL),
(25, 1, NULL, 'تيرموس قهوة 40 شيكل', 28.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:13', '2026-09-15 10:39:13', NULL),
(26, 1, NULL, 'صينيه تقديم بيوتر حجم صغير', 30.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:13', '2026-09-15 10:39:13', NULL),
(27, 1, NULL, 'طقم  6 كاسات + 6 فناجين ساده', 17.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:13', '2026-09-15 10:39:13', NULL),
(28, 1, NULL, 'طقم جاط مع مكتات زجاج', 55.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:13', '2026-09-15 10:39:13', NULL),
(29, 1, NULL, 'ابريق عصير مع حنفيه بيوتر 50 شيقل', 42.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:13', '2026-09-15 10:39:13', NULL),
(30, 1, NULL, 'طقم سكريات بيوتر 3 قطع', 45.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:13', '2026-09-15 10:39:13', NULL),
(31, 1, NULL, 'مضيفه زجاج بيوتر 35', 28.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:13', '2026-09-15 10:39:13', NULL),
(32, 1, NULL, 'قالب كب كيك 1 قطعه صغير', 2.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:13', '2026-09-15 10:39:13', NULL),
(33, 1, NULL, 'ابريق عصير زجاج الصين', 4.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:13', '2026-09-15 10:39:13', NULL),
(34, 1, NULL, 'كاسات شاي شفاف 12قطعه بقاعده s21', 12.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:13', '2026-09-15 10:39:13', NULL),
(35, 1, NULL, 'طقم صحون بورسلان 12 قطعه', 38.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:13', '2026-09-15 10:39:13', NULL),
(36, 1, NULL, 'طقم صحون بورسلان 36 قطعة 65 شيقل', 55.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:13', '2026-09-15 10:39:13', NULL),
(37, 1, NULL, 'طقم مكسرات مع صينيه خشب 7 قطع', 28.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:13', '2026-09-15 10:39:13', NULL),
(38, 1, NULL, 'طقم صحون 18 قطعه شفاف 35 شيقل', 24.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:13', '2026-09-15 10:39:13', NULL),
(39, 1, NULL, 'كاسات شاي 12 قطعه 25 شيقل', 22.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:13', '2026-09-15 10:39:13', NULL),
(40, 1, NULL, 'طقم فناجين قهوة 6+6 شفاف', 10.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:13', '2026-09-15 10:39:13', NULL),
(41, 1, NULL, 'طقم طنجره مع زبادي زجاج عسلي 5 قطع', 23.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:13', '2026-09-15 10:39:13', NULL),
(42, 1, NULL, 'طقم كاسات شاي مع صينيه زجاج عسلي 7 قطع', 22.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:13', '2026-09-15 10:39:13', NULL),
(43, 1, NULL, 'معالق خشب 3 قطع', 1.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:13', '2026-09-15 10:39:13', NULL),
(44, 1, NULL, 'طقم زبادي زجاج 6 قطع 10 شيقل', 6.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:13', '2026-09-15 10:39:13', NULL),
(45, 1, NULL, 'قشاطة مجلى', 3.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:13', '2026-09-15 10:39:13', NULL),
(46, 1, NULL, 'طقم سكاكين فواكه 5 شيقل', 3.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:13', '2026-09-15 10:39:13', NULL),
(47, 1, NULL, 'طقم ابريق عصير مع كاسات 5 قطع', 12.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:13', '2026-09-15 10:39:13', NULL),
(48, 1, NULL, 'طقم ابريق عصير مع كاسات 7 قطع', 21.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:13', '2026-09-15 10:39:13', NULL),
(49, 1, NULL, 'طقم ابريق عصير مع كاسات 8 قطع', 28.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:13', '2026-09-15 10:39:13', NULL),
(50, 1, NULL, 'طقم ابريق عصير مع كاسات بيوتر 7 قطع', 54.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:13', '2026-09-15 10:39:13', NULL),
(51, 1, NULL, 'طقم زبادي زجاج 7 قطع  s3', 11.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:13', '2026-09-15 10:39:13', NULL),
(52, 1, NULL, 'كاسات عصير 12 قطعه 25 شيكل', 20.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:13', '2026-09-15 10:39:13', NULL),
(53, 1, NULL, 'كاسات عصير 6+4 قطع', 3.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:13', '2026-09-15 10:39:13', NULL),
(54, 1, NULL, 'طقم فناجين قهوه 12 قطعه ابيض وذهبي', 31.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:13', '2026-09-15 10:39:13', NULL),
(55, 1, NULL, 'محارم جيب 10 قطع', 2.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:13', '2026-09-15 10:39:13', NULL),
(56, 1, NULL, 'مكته 2 شيكل', 1.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:13', '2026-09-15 10:39:13', NULL),
(57, 1, NULL, 'محارم معطره  80 قطعه', 1.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:13', '2026-09-15 10:39:13', NULL),
(58, 1, NULL, 'جلاتين طعام 30 سم', 7.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:13', '2026-09-15 10:39:13', NULL),
(59, 1, NULL, 'فونيك', 2.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:13', '2026-09-15 10:39:13', NULL),
(60, 1, NULL, 'عصا خشب قصير', 0.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:13', '2026-09-15 10:39:13', NULL),
(61, 1, NULL, 'عصا خشب طويل', 2.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:13', '2026-09-15 10:39:13', NULL),
(62, 1, NULL, 'شرشف طاولة استعمال مرة واحدة', 0.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:13', '2026-09-15 10:39:13', NULL),
(63, 1, NULL, 'قشاطه ارض 35 سم', 3.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:13', '2026-09-15 10:39:13', NULL),
(64, 1, NULL, 'شمع اصابع 4 قطع', 0.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:13', '2026-09-15 10:39:13', NULL),
(65, 1, NULL, 'حبل غسيل قماش 10 متر', 2.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:13', '2026-09-15 10:39:13', NULL),
(66, 1, NULL, 'فرشاية حمام 5 شيقل', 2.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:13', '2026-09-15 10:39:13', NULL),
(67, 1, NULL, 'حبل غسيل سلك 20 متر', 2.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:13', '2026-09-15 10:39:13', NULL),
(68, 1, NULL, 'ليف جلي 4 قطع  الاحمد', 1.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:13', '2026-09-15 10:39:13', NULL),
(69, 1, NULL, 'مزيل عرق', 3.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:13', '2026-09-15 10:39:13', NULL),
(70, 1, NULL, 'طقم فناجين قهوة سادة 12 قطعة 15 شيكل', 9.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:13', '2026-09-15 10:39:13', NULL),
(71, 1, NULL, 'فرشاية سجاد 5 شيقل', 2.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:13', '2026-09-15 10:39:13', NULL),
(72, 1, NULL, 'سلكه 6 قطع', 1.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:13', '2026-09-15 10:39:13', NULL),
(73, 1, NULL, 'جلاتين طعام  45 سم', 7.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:13', '2026-09-15 10:39:13', NULL),
(74, 1, NULL, 'محارم  كيلو جرام', 8.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:13', '2026-09-15 10:39:13', NULL),
(75, 1, NULL, 'محارم 800 جرام', 7.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:13', '2026-09-15 10:39:13', NULL),
(76, 1, NULL, 'طقم مكسرات شفاف 6 قطع s32', 12.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:13', '2026-09-15 10:39:13', NULL),
(77, 1, NULL, 'طقم مكسرات عسلي 6+6 s3', 20.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:13', '2026-09-15 10:39:13', NULL),
(78, 1, NULL, 'مضيفه بيوتر صغير', 7.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:13', '2026-09-15 10:39:13', NULL),
(79, 1, NULL, 'كاسات شاي 6 قطع 12 شيكل', 9.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:13', '2026-09-15 10:39:13', NULL),
(80, 1, NULL, 'طقم سكريات بلاستك', 7.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:13', '2026-09-15 10:39:13', NULL),
(81, 1, NULL, 'مج زجاج  + مصاصه رسم يدوي', 10.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:13', '2026-09-15 10:39:13', NULL),
(82, 1, NULL, 'مفرمه خشب 5 شيقل', 2.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:13', '2026-09-15 10:39:13', NULL),
(83, 1, NULL, 'كاسات ماء 6 قطع 15 شيكل s3', 11.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:13', '2026-09-15 10:39:13', NULL),
(84, 1, NULL, 'مفرمه خشب بامبو 20*30', 5.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:13', '2026-09-15 10:39:13', NULL),
(85, 1, NULL, 'مفرمه خشب بامبو 24*34', 7.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:13', '2026-09-15 10:39:13', NULL),
(86, 1, NULL, 'مضيفه بيوتر وسط', 23.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:13', '2026-09-15 10:39:13', NULL),
(87, 1, NULL, 'مضيفه بيوتر مع غطاء حجم صغير', 13.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:13', '2026-09-15 10:39:13', NULL),
(88, 1, NULL, 'جاط فواكه بيوتر شكل ورقه صغير', 8.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:13', '2026-09-15 10:39:13', NULL),
(89, 1, NULL, 'ملقط سلطه ستالس', 1.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:13', '2026-09-15 10:39:13', NULL),
(90, 1, NULL, 'شبك  شوي 10 شيقل', 5.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:13', '2026-09-15 10:39:13', NULL),
(91, 1, NULL, 'ماكينة كبه زنبرك', 9.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(92, 1, NULL, 'تيرموس اطفال بلاستك حجم صغير 0.5 لتر s1', 7.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(93, 1, NULL, 'صينيه بلاستك', 1.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(94, 1, NULL, 'طقم سلات قش 3 قطع', 30.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(95, 1, NULL, 'طقم قوالب تشيز كيك مدور 3 قطع', 9.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(96, 1, NULL, 'طقم غلايات قهوة جرانيت 3 قطع', 33.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(97, 1, NULL, 'شمعدان خماسي كرستال وسط', 55.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(98, 1, NULL, 'قلايه بطاطا جرانيت مع مصفاي حجم 24سم', 25.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(99, 1, NULL, 'جاط فواكه بيوتر 2 قطعة', 37.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(100, 1, NULL, 'مضيفه بيوتر مع غطاء حجم وسط', 15.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(101, 1, NULL, 'سكرية بيوتر 10+ زجاج شيقل', 6.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(102, 1, NULL, 'مجرود ارض 4 قطع s4', 4.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(103, 1, NULL, 'طقم سكريات بيوتر 3 قطع مع قاعدة', 30.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(104, 1, NULL, 'مضيفه بيوتر 3 قطع', 23.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(105, 1, NULL, 'هراسه ثوم  نص دائري s4', 3.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(106, 1, NULL, 'صينيه تقديم بيوتر', 38.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(107, 1, NULL, 'طقم صحون 18 قطعة 30 شيقل', 21.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(108, 1, NULL, 'طقم صحون 24 قطعه S8', 33.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(109, 1, NULL, 'طقم صحون 7 قطع 15 شيقل', 11.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(110, 1, NULL, 'مضيفه بيوتر كبير', 38.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(111, 1, NULL, 'علبه محارم خشب + قاعده بيوتر 25', 18.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(112, 1, NULL, 'جاط فواكه بيوتر شكل ورقه وسط', 13.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(113, 1, NULL, 'طقم ستاند ضيافة 3 قطع  قاعدة خشب', 63.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(114, 1, NULL, 'طقم مضايف 3 احجام', 35.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(115, 1, NULL, 'تحفه جره اسود', 40.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(116, 1, NULL, 'طقم سكريات بيوتر  2 قطعه مع قاعدة', 23.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(117, 1, NULL, 'ميزان مطبخ', 7.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(118, 1, NULL, 'مشك صحون المنيوم 2 طابق s21', 58.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(119, 1, NULL, 'طقم سكاكين فواكه 10 شيقل', 5.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(120, 1, NULL, 'صينيه تقديم اكريلاك', 7.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(121, 1, NULL, 'شمعدان خماسي كريستال كبير', 73.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(122, 1, NULL, 'جاط فواكه بيوتر شكل ورقه كبير', 18.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(123, 1, NULL, 'حمالة صابونة بلاستك 3 شيقل', 1.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(124, 1, NULL, 'صينيه المنيوم مستطيل 46*33', 16.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(125, 1, NULL, 'ميزان جسم', 17.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(126, 1, NULL, 'مبشرة ستالس هرم', 4.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(127, 1, NULL, 'سكينة مفرد يد خشب نجمه نصل رفيع 5 انش', 5.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(128, 1, NULL, 'طقم طناجر ستالس 4 قطع', 50.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(129, 1, NULL, 'طقم طناجر ستالس 5 قطع', 84.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(130, 1, NULL, 'سكرية بيوتر برجل 7 شيقل', 4.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(131, 1, NULL, 'مبشرة سحريه', 13.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(132, 1, NULL, 'طقم صواني تقديم خشب 3/2 قطع', 32.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(133, 1, NULL, 'سدر ملمين حجم 25 سم', 2.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(134, 1, NULL, 'سدر ملمين خفيف حجم 30 سم', 2.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(135, 1, NULL, 'سدر ملمين خفيف حجم 35 سم', 3.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(136, 1, NULL, 'سدر ملمين خفيف حجم 40 سم', 4.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(137, 1, NULL, 'سدر ملمين خفيف حجم 45 سم', 5.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(138, 1, NULL, 'سدر جرانيت حجم 40 سم', 16.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(139, 1, NULL, 'سدر جرانيت حجم  45 سم', 20.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(140, 1, NULL, 'سدر جرانيت حجم 50 سم', 24.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(141, 1, NULL, 'ابريق شاي ستالس ثقيل يد خشب 1 لتر', 25.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(142, 1, NULL, 'ابريق شاي ستالس ثقيل يد خشب 1.5 لتر', 30.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(143, 1, NULL, 'ابريق شاي ستالس ثقيل يد خشب 2 لتر', 35.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(144, 1, NULL, 'طنجرة مقلوبة مع صينية حجم 30 سم', 45.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(145, 1, NULL, 'طنجرة مقلوبة مع صينية حجم 34 سم', 55.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(146, 1, NULL, 'طقم طناجر 5 قطع سكب ثقيل', 240.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(147, 1, NULL, 'سكرية بيوتر حجم وسط 18 شيقل', 13.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(148, 1, NULL, 'سلة خضار 4 طبقات بلاستك رتان', 33.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(149, 1, NULL, 'تبروير شفاف 25 لتر مدور', 15.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(150, 1, NULL, 'سطل نفايات شبك بلاستك', 1.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(151, 1, NULL, 'مرتبان بلاستك نصف كيلو', 0.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(152, 1, NULL, 'مرتبان بلاستك 1 كيلو', 0.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(153, 1, NULL, 'مرتبان بلاستك 2 كيلو', 1.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(154, 1, NULL, 'مرتبان بلاستك 3 كيلو', 2.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(155, 1, NULL, 'سطل ماء 18 لتر s21', 6.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(156, 1, NULL, 'مشك صحون بلاستك 2 طبقة', 21.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(157, 1, NULL, 'مشك صحون بلاستك 3 طبقة', 27.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(158, 1, NULL, 'سله خضار 4 طبقات بلاستك ورده او بيضاوي', 12.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(159, 1, NULL, 'زاوية حمام  3 طبقات بلاستك', 7.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(160, 1, NULL, 'زاوية حمام  3 طبقات بلاستك', 9.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(161, 1, NULL, 'عربايه جرة غاز بلاستك', 7.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(162, 1, NULL, 'سطل مروحة 20 لتر بلاستك', 15.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(163, 1, NULL, 'سطل دعسة رتان بلاستك', 16.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(164, 1, NULL, 'تبروير شفاف 20 لتر', 13.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(165, 1, NULL, 'تبروير شفاف 7 لتر مربع', 6.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(166, 1, NULL, 'مراي بلاستك حجم صغير', 11.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(167, 1, NULL, 'مراي بلاستك حجم كبير', 16.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(168, 1, NULL, 'علاقه ملابس 12 قطعة بلاستك', 5.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(169, 1, NULL, 'كزرولا جرانيت يد بلاستيك', 11.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(170, 1, NULL, 'كاسات عصير 12 قطعه  عرض S21', 12.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(171, 1, NULL, 'مشك صحون المنيوم جنب خشب 2 طابق', 75.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(172, 1, NULL, 'طقم صواني بيوتر 2 قطعه', 35.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(173, 1, NULL, 'طقم فناجين قهوه 6 + 6', 22.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(174, 1, NULL, 'طقم كاسات شاي 6 + 6', 25.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(175, 1, NULL, 'طنجره جرانيت عرض حجم 24سم', 20.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(176, 1, NULL, 'مبشرة ستالس كف', 2.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(177, 1, NULL, 'قوار بلاستك تعليق 2 عين', 4.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(178, 1, NULL, 'قوار بلاستك تعليق 3 عين', 6.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(179, 1, NULL, 'طقم طناجر 5 قطع سكب ثقيل  s24', 110.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(180, 1, NULL, 'علبه محارم خشب مشكل', 6.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(181, 1, NULL, 'مصفاية حوض مجلى 3 قطع ع كرت', 1.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(182, 1, NULL, 'مصفاية رز منخل صغير', 4.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(183, 1, NULL, 'ابريق شاي زجاج 2.2 لتر غطاء بلاستك', 18.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(184, 1, NULL, 'ابريق شاي زجاج 1.8 لتر غطاء بلاستك', 17.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(185, 1, NULL, 'ابريق شاي زجاج 1.4 لتر غطاء بلاستك', 14.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(186, 1, NULL, 'ابريق شاي زجاج 1.1لتر غطاء بلاستك', 13.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(187, 1, NULL, 'ابريق شاي زجاج 0.85 لتر غطاء بلاستك', 12.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(188, 1, NULL, 'طقم معالق 16 قطعه فضي صندوق هدايا', 32.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(189, 1, NULL, 'جوارير اكسسوارات بلاستك', 7.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(190, 1, NULL, 'تبروير شفاف 2 لتر  مشكل', 2.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(191, 1, NULL, 'ستاند تزين كيك بلاستك ابيض الصين', 7.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(192, 1, NULL, 'صينيه المنيوم مستطيل 33*24', 13.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(193, 1, NULL, 'كاسات اطفال 6 قطع بلاستك', 3.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(194, 1, NULL, 'كاسه اطفال بلاستك 1 قطعه', 1.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(195, 1, NULL, 'طقم غلايات قهوه ستالس 3 قطع مع غطا يد سيلكون', 37.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(196, 1, NULL, 'حرام اطفال', 3.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(197, 1, NULL, 'لجن + مصفاي بلاستك', 5.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(198, 1, NULL, 'كوستر قماش 4 قطع', 3.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(199, 1, NULL, 'طنجره زجاج 1 قطعه', 9.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(200, 1, NULL, 'سياخ نش خشب', 1.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(201, 1, NULL, 'علبه محارم خشب 15 شيقل', 10.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(202, 1, NULL, 'حافظه بيض بلاستك صغير', 1.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(203, 1, NULL, 'قالب كب كيك 12 قطعه', 3.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(204, 1, NULL, 'مضيفه خشب 2 طابق 12 شيقل', 8.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(205, 1, NULL, 'كيس غسيل ملابس قماش', 2.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(206, 1, NULL, 'اكسسوارات حمام مشكل 10 شيقل', 4.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(207, 1, NULL, 'علاقة بشكير ستالس صغير ايلول', 3.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(208, 1, NULL, 'علاقة بشكير ستالس كبير 10 شيقل', 4.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(209, 1, NULL, 'طقم معيار بلاستك 5 شيقل', 1.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(210, 1, NULL, 'منظم اكسسوارات 3.5 شيقل', 2.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(211, 1, NULL, 'فرشايه رضاعه 1 شيقل', 0.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(212, 1, NULL, 'فرشاية اسنان كهربا', 14.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(213, 1, NULL, 'غلاية قهوة ستالس الجمل حجم 14', 9.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(214, 1, NULL, 'غلاية قهوة ستالس الجمل حجم 13', 8.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(215, 1, NULL, 'غلاية قهوة ستالس الجمل حجم 12', 7.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(216, 1, NULL, 'غلاية قهوة ستالس الجمل حجم 11', 7.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(217, 1, NULL, 'غلاية قهوة ستالس الجمل حجم 10', 6.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(218, 1, NULL, 'ليف جلي 3 قطع الصين', 1.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(219, 1, NULL, 'شبك قلي ستالس يد خشب حجم 1', 7.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(220, 1, NULL, 'شبك قلي ستالس يد خشب حجم 2', 7.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(221, 1, NULL, 'شبك قلي ستالس يد خشب حجم 3', 8.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(222, 1, NULL, 'شبك قلي ستالس يد خشب حجم 4', 8.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(223, 1, NULL, 'صاجية يد بلاستك 30 شيقل', 16.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(224, 1, NULL, 'سطل نفايات  بلاستك ملون 5 شيقل', 2.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(225, 1, NULL, 'طنجرة ضغط جرانيت 10 لتر', 70.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(226, 1, NULL, 'طنجرة ضغط جرانيت 8 لتر', 65.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(227, 1, NULL, 'مجرود ارض طويل 2 قطعة عرض', 4.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(228, 1, NULL, 'طقم سطل حمام بلاستك 6 قطع', 23.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(229, 1, NULL, 'طنجرة ضغط جرانيت 6 لتر', 70.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(230, 1, NULL, 'طقم قوالب تشيز كيك سداسي 3 قطع 3-605', 17.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(231, 1, NULL, 'طقم قوالب تشيز كيك مشكل 3 قطع', 13.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(232, 1, NULL, 'علبه محارم 5 شيكل', 2.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(233, 1, NULL, 'صينيه المنيوم مستطيل 60*40', 20.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(234, 1, NULL, 'مكتة 10 شيكل', 7.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(235, 1, NULL, 'طقم بهارات 16 قطعه ستالس 1-107', 28.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(236, 1, NULL, 'علاقة كفاكير 6 عيون قدح', 1.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(237, 1, NULL, 'ابريق زهورات زجاج', 15.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(238, 1, NULL, 'سكرية زجاج  عرض', 2.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(239, 1, NULL, 'لمامة سجاد 6 عيون', 2.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(240, 1, NULL, 'علبه خبز خشب تركي', 5.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(241, 1, NULL, 'طنجرة ضغط جرانيت 12 لتر', 65.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(242, 1, NULL, 'طنجرة ضغط جرانيت 4 لتر', 60.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(243, 1, NULL, 'طقم اباريق شاي 3 قطع', 16.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(244, 1, NULL, 'سطل نفايات  بلاستك ملون 10 شيقل', 5.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(245, 1, NULL, 'منشر حمام بلاستك 5 شيقل', 1.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(246, 1, NULL, 'مصفاية رز ستالس بدون يد حجم 26 سم', 7.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(247, 1, NULL, 'مصفاية رز ستالس بدون يد حجم 28 سم', 7.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(248, 1, NULL, 'مصفاية رز ستالس بدون يد حجم 30 سم', 8.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(249, 1, NULL, 'مصفاية رز ستالس بدون يد حجم 32 سم', 9.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(250, 1, NULL, 'مصفاية رز ستالس بدون يد حجم 34 سم', 10.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(251, 1, NULL, 'مصفاية رز ستالس بدون يد حجم 36 سم', 12.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(252, 1, NULL, 'مصفاية رز ستالس بدون يد حجم 38 سم', 13.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(253, 1, NULL, 'مصفاية رز ستالس بدون يد حجم 40 سم', 14.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(254, 1, NULL, 'مشك صحون 2 طابق فوق المجلى', 60.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(255, 1, NULL, 'قالب كيك للفرن  10 شيقل', 4.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(256, 1, NULL, 'صاجية اسود عرض', 9.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(257, 1, NULL, 'سدر ستالس حجم 25 سم', 1.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(258, 1, NULL, 'سدر ستالس حجم 30 سم', 2.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(259, 1, NULL, 'سدر ستالس حجم 35 سم', 3.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(260, 1, NULL, 'سدر ستالس حجم 40 سم', 4.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(261, 1, NULL, 'سدر ستالس حجم 50 سم', 5.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(262, 1, NULL, 'تيرموس قهوة ماربل الصين', 32.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(263, 1, NULL, 'كاسات عصير 6 قطع 22 شيقل', 17.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(264, 1, NULL, 'ستاند عرض صحون خشب', 1.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(265, 1, NULL, 'طقم سطل حمام حديد 2 قطعة ماربل', 30.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(266, 1, NULL, 'سكينة ملوخية يد بلاستك', 6.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(267, 1, NULL, 'مجرود ارض 1 قطعه بلاستك تركي', 1.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(268, 1, NULL, 'كفكير بهار بلاستك كبير', 1.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(269, 1, NULL, 'كفكير بهار بلاستك وسط', 1.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(270, 1, NULL, 'كفكير بهار بلاستك صغير', 0.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(271, 1, NULL, 'طقم مصافي شاي 3 قطع حجم كبير', 3.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(272, 1, NULL, 'قداحة غاز طويل حديد', 9.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(273, 1, NULL, 'مجرود مجلى 2 قطعه 5 شيقل', 1.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(274, 1, NULL, 'مساكه سخن 2 قطعة 34-211', 1.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(275, 1, NULL, 'علبة فراشي اسنان', 1.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(276, 1, NULL, 'منصب تسخين خبز مع يد خشب', 2.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(277, 1, NULL, 'مسن سكاكين جزره', 4.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(278, 1, NULL, 'ملاقط غسيل بلاستك 20 قطعة', 1.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(279, 1, NULL, 'سكينة ملوخية يد خشب', 4.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(280, 1, NULL, 'ورق جدران فوق الغاز تلزيق', 1.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(281, 1, NULL, 'علاقة بشكير طبع تلزيق', 3.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(282, 1, NULL, 'ستاند محارم مطبخ خشب شكل كرسي', 12.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(283, 1, NULL, 'طقم كفكير بهار بلاستك 3 قطع', 2.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:14', '2026-09-15 10:39:14', NULL),
(284, 1, NULL, 'قشارة بطاطا مشكل', 2.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:15', '2026-09-15 10:39:15', NULL),
(285, 1, NULL, 'قصدير غاز 10 قطع', 2.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:15', '2026-09-15 10:39:15', NULL),
(286, 1, NULL, 'نكاشات اذن طبي', 1.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:15', '2026-09-15 10:39:15', NULL),
(287, 1, NULL, 'علب هدايا خشب مشكل', 3.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:15', '2026-09-15 10:39:15', NULL),
(288, 1, NULL, 'مصفاية رز منخل وسط', 6.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:15', '2026-09-15 10:39:15', NULL),
(289, 1, NULL, 'مصفاية رز منخل كبير', 6.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:15', '2026-09-15 10:39:15', NULL),
(290, 1, NULL, 'مكتة زجاج شفاف  5 شيقل', 2.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:15', '2026-09-15 10:39:15', NULL),
(291, 1, NULL, 'مرش تعقيم 3 قطع', 3.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:15', '2026-09-15 10:39:15', NULL),
(292, 1, NULL, 'مرق عجين خشب  كبير', 4.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:15', '2026-09-15 10:39:15', NULL),
(293, 1, NULL, 'عصارة حامض بلاستك', 2.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:15', '2026-09-15 10:39:15', NULL),
(294, 1, NULL, 'ليفة جلي1 قطعة 7-512', 1.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:15', '2026-09-15 10:39:15', NULL),
(295, 1, NULL, 'شبك شوي 15 شيقل', 8.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:15', '2026-09-15 10:39:15', NULL),
(296, 1, NULL, 'اكياس تخزين ملابس 70*100سم', 2.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:15', '2026-09-15 10:39:15', NULL),
(297, 1, NULL, 'طقم صابونة 2 قطعة', 4.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:15', '2026-09-15 10:39:15', NULL),
(298, 1, NULL, 'علاقة بشكير * اكياس بلاستك', 1.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:15', '2026-09-15 10:39:15', NULL),
(299, 1, NULL, 'ستاند مجات', 3.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:15', '2026-09-15 10:39:15', NULL),
(300, 1, NULL, 'قشاطة ارض 55 سم', 4.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:15', '2026-09-15 10:39:15', NULL),
(301, 1, NULL, 'ورد مجفف كبير', 4.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:15', '2026-09-15 10:39:15', NULL),
(302, 1, NULL, 'ورد مجفف وسط', 3.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:15', '2026-09-15 10:39:15', NULL),
(303, 1, NULL, 'ورد مجفف صغير', 1.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:15', '2026-09-15 10:39:15', NULL),
(304, 1, NULL, 'حافظه بيض بلاستك كبير', 4.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:15', '2026-09-15 10:39:15', NULL),
(305, 1, NULL, 'مدق ثوم بلاستك', 6.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:15', '2026-09-15 10:39:15', NULL),
(306, 1, NULL, 'سلة ضيافة شبك حديد', 4.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:15', '2026-09-15 10:39:15', NULL),
(307, 1, NULL, 'غلاية قهوة زجاج بدون غطاء s42', 6.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:15', '2026-09-15 10:39:15', NULL),
(308, 1, NULL, 'منظم معالق جارور حجم صغير بلاستك تركي', 2.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:15', '2026-09-15 10:39:15', NULL),
(309, 1, NULL, 'منظم اكسسوارات اكريلك مقطع', 4.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:15', '2026-09-15 10:39:15', NULL),
(310, 1, NULL, 'عجل بيتزا', 2.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:15', '2026-09-15 10:39:15', NULL),
(311, 1, NULL, 'قطاعة بطاطا اشكال', 1.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:15', '2026-09-15 10:39:15', NULL),
(312, 1, NULL, 'سفنجة مجلى', 2.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:15', '2026-09-15 10:39:15', NULL),
(313, 1, NULL, 'طقم صحون 7 قطع 35 شيقل', 30.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:15', '2026-09-15 10:39:15', NULL),
(314, 1, NULL, 'عصارة حامض  يدوية حديد صغير', 2.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:15', '2026-09-15 10:39:15', NULL),
(315, 1, NULL, 'مساكة سخن 2 قطعة  s17', 1.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:15', '2026-09-15 10:39:15', NULL),
(316, 1, NULL, 'كوستر سيلكون 6 قطع', 1.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:15', '2026-09-15 10:39:15', NULL),
(317, 1, NULL, 'مضيفة زجاج مشكل', 6.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:15', '2026-09-15 10:39:15', NULL),
(318, 1, NULL, 'ستاند محارم مطبخ ستالس 5/6-413', 2.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:15', '2026-09-15 10:39:15', NULL),
(319, 1, NULL, 'شمع مدور 50 قطعة', 5.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:15', '2026-09-15 10:39:15', NULL),
(320, 1, NULL, 'سلة فواكة بلاستك تركي', 5.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:15', '2026-09-15 10:39:15', NULL),
(321, 1, NULL, 'ستاند معالق بلاستك', 2.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:15', '2026-09-15 10:39:15', NULL),
(322, 1, NULL, 'شمعدان زجاج حجم صغير', 6.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:15', '2026-09-15 10:39:15', NULL),
(323, 1, NULL, 'ليف جلي 3 قطع  4-512', 2.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:15', '2026-09-15 10:39:15', NULL),
(324, 1, NULL, 'سدر ستالس حجم 45 سم', 4.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:15', '2026-09-15 10:39:15', NULL),
(325, 1, NULL, 'طقم بايركس جاط 2 قطعة عرض', 14.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:15', '2026-09-15 10:39:15', NULL),
(326, 1, NULL, 'طقم فناجين قهوة 12 قطعة مرسم', 10.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:15', '2026-09-15 10:39:15', NULL),
(327, 1, NULL, 'طقم مجات بورسلان 6 قطع', 22.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:15', '2026-09-15 10:39:15', NULL),
(328, 1, NULL, 'طقم زبادي 6 قطع بورسلان', 15.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:15', '2026-09-15 10:39:15', NULL),
(329, 1, NULL, 'طقم مجات نسكافية بورسلان 12 قطعة', 17.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:15', '2026-09-15 10:39:15', NULL),
(330, 1, NULL, 'مصفاية بهار طابة', 1.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:15', '2026-09-15 10:39:15', NULL),
(331, 1, NULL, 'سياخ نش ستالس', 4.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:15', '2026-09-15 10:39:15', NULL),
(332, 1, NULL, 'سطل نفايات مع عجال 25 شيقل', 18.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:15', '2026-09-15 10:39:15', NULL),
(333, 1, NULL, 'طقم محقان 3 قطع', 3.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:15', '2026-09-15 10:39:15', NULL),
(334, 1, NULL, 'مرش حلاقة', 1.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:15', '2026-09-15 10:39:15', NULL),
(335, 1, NULL, 'طقم كفاكير ستالس 6 قطع', 13.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:15', '2026-09-15 10:39:15', NULL),
(336, 1, NULL, 'طقم تبرويرات بلاستك 3 قطع 5 شيقل', 3.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:15', '2026-09-15 10:39:15', NULL),
(337, 1, NULL, 'مضخة كاز', 1.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:15', '2026-09-15 10:39:15', NULL),
(338, 1, NULL, 'عرباية مطبخ بلاستك 3 طبقات', 22.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:15', '2026-09-15 10:39:15', NULL),
(339, 1, NULL, 'ابريق عصير زجاج 5 شيقل', 4.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:15', '2026-09-15 10:39:15', NULL),
(340, 1, NULL, 'طقم مصافي شاي 3 قطع كرت ازرق', 2.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:15', '2026-09-15 10:39:15', NULL),
(341, 1, NULL, 'طقم مصافي رز منخل 3 قطع صغير', 4.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:15', '2026-09-15 10:39:15', NULL),
(342, 1, NULL, 'طقم مصافي رز منخل 3 قطع وسط', 10.00, 0, 1, NULL, '\"[]\"', NULL, '2026-09-15 10:39:15', '2026-09-15 10:39:15', NULL);
    ";

    try {
        // تعطيل قيود المفاتيح الأجنبية لتجنب أي تعارض أثناء الإدخال المباشر
        // DB::statement('SET FOREIGN_KEY_CHECKS=0;');

        // تنفيذ استعلام الـ INSERT
        DB::unprepared($sql);

        // إعادة تفعيل القيود
        // DB::statement('SET FOREIGN_KEY_CHECKS=1;');

        return "SQL Executed Successfully!";
    } catch (\Exception $e) {
        return "Error executing SQL: " . $e->getMessage();
    }
});




Route::middleware(['auth', 'verified', 'is_admin'])->prefix('admin')->name('admin.')->group(function () {

    // صفحة الداشبورد الخاصة بالأدمن
    Route::view('/dashboard', 'pages.admin.dashboard')->name('dashboard');
    Route::livewire('/plan', 'pages::admin.plans')->name('plan');
    Route::livewire('/user', 'pages::admin.users')->name('user');
});
Route::middleware(['auth', 'verified'])->group(function () {

    // صفحة الداشبورد الخاصة بالمستخدم/المتجر

    Route::view('/dashboard', 'pages.tenant.dashboard')->name('dashboard');
    Route::livewire('dashboard/user', 'pages::tenant.branch')->name('branch');
    Route::livewire('dashboard/role', 'pages::tenant.role')->name('role');
    Route::livewire('dashboard/employees', 'pages::tenant.employees')->name('employees');
    Route::livewire('dashboard/product', 'pages::tenant.product')->name('product');
    Route::livewire('dashboard/pos', 'pages::tenant.pos')->name('pos');
    Route::livewire('/dashboard/analytics', 'pages::tenant.analytics')->name('analytics');
    Route::livewire('/dashboard/store/{slug}', 'pages::tenant.store')->name('store');;
    Route::livewire('/dashboard/online', 'pages::tenant.online-orders')->name('storeORDEE');
    Route::livewire('/dashboard/Wholesale', 'pages::tenant.wholesale-interface')->name('wholesaleinterface');
    Route::livewire('/dashboard/orders', 'pages::tenant.wholesale-orders')->name('wholesaleorders');
    Route::livewire('/dashboard/DailySettlementComponent', 'pages::tenant.daily-settlement-component')->name('DailySettlementComponent');


    Route::livewire('/dashboard/print', 'pages::tenant.print')->name('print');






    Route::livewire('/post/create', 'pages::post.create');



    Route::livewire('dashboard/purchases', 'pages::tenant.purchase')->name('purchases');
    Route::livewire('dashboard/wholesale', 'pages::tenant.wholesale')->name('wholesale');
    Route::livewire('dashboard/customer', 'pages::tenant.customer')->name('customer');
    Route::livewire('dashboard/supplier', 'pages::tenant.supplier')->name('supplier');

    Route::livewire('dashboard/receipt', 'pages::tenant.receipt-vouchers')->name('receipt');
    Route::livewire('dashboard/payment', 'pages::tenant.payment')->name('payment');
    Route::livewire('dashboard/exsel', 'pages::tenant.exsel')->name('exsel');

    // Route::livewire('dashboard/purchases', 'pages::tenant.')->name('purchases');






    // أضف بقية مسارات المتجر هنا مستقبلاً (مثل نقاط البيع والمنتجات)
    // Volt::route('/pos', 'tenant.pos.index')->name('pos.index');
});

require __DIR__ . '/settings.php';
